perf/stress/exchange_post.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: 'artillery-api'

  pool: 400

  phases:
    - name: Ramp up
      duration: 20
      arrivalRate: 100
      rampTo: 500
    - name: Plain
      duration: 20
      arrivalRate: 600
    - name: Ramp down
      duration: 20
      arrivalRate: 500
      rampTo: 100
    - name: Stop
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Exchange STRESS (POST /exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            baseAmount: 20000
            baseAccountId: 11
            counterAccountId: 10