perf/stress/exchange_post.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: 'artillery-api'

  pool: 400

  phases:
    - name: Ramp up
      duration: 15
      arrivalRate: 50
      rampTo: 250
    - name: Plain
      duration: 10
      arrivalRate: 300
    - name: Ramp down
      duration: 15
      arrivalRate: 250
      rampTo: 50
    - name: Stop
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Exchange STRESS (POST /exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            baseAmount: 100
            baseAccountId: 11
            counterAccountId: 10